hw_2/ab-test.txt
for app (gunicorn)

# ab -c 3 -t 1 http://app-hw2:8000/
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking app-hw2 (be patient)
Completed 5000 requests
Completed 10000 requests
Completed 15000 requests
Finished 15303 requests


Server Software:        gunicorn
Server Hostname:        app-hw2
Server Port:            8000

Document Path:          /
Document Length:        14 bytes

Concurrency Level:      3
Time taken for tests:   1.000 seconds
Complete requests:      15303
Failed requests:        0
Total transferred:      2341359 bytes
HTML transferred:       214242 bytes
Requests per second:    15302.86 [#/sec] (mean)
Time per request:       0.196 [ms] (mean)
Time per request:       0.065 [ms] (mean, across all concurrent requests)
Transfer rate:          2286.46 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       1
Processing:     0    0   0.1      0      10
Waiting:        0    0   0.1      0       9
Total:          0    0   0.1      0      10

Percentage of the requests served within a certain time (ms)
  50%      0
  66%      0
  75%      0
  80%      0
  90%      0
  95%      0
  98%      0
  99%      0
 100%     10 (longest request)

+++++++++++===================+++++++++++
+++++++++++===================+++++++++++

for nginx:

ab -c 3 -t 1 http://nginx/
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking nginx (be patient)
Finished 3412 requests


Server Software:        nginx/1.25.4
Server Hostname:        nginx
Server Port:            80

Document Path:          /
Document Length:        172 bytes

Concurrency Level:      3
Time taken for tests:   1.000 seconds
Complete requests:      3412
Failed requests:        0
Total transferred:      1378448 bytes
HTML transferred:       586864 bytes
Requests per second:    3411.44 [#/sec] (mean)
Time per request:       0.879 [ms] (mean)
Time per request:       0.293 [ms] (mean, across all concurrent requests)
Transfer rate:          1345.92 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       1
Processing:     0    1   0.1      1       4
Waiting:        0    1   0.1      1       4
Total:          1    1   0.1      1       4

Percentage of the requests served within a certain time (ms)
  50%      1
  66%      1
  75%      1
  80%      1
  90%      1
  95%      1
  98%      1
  99%      1
 100%      4 (longest request)